app/controllers/authentications_controller.rb

  def create
    auth = request.env["omniauth.auth"]
    # Try to find authentication first
    authentication = Authentication.find_by_provider_and_uid(auth['provider'], auth['uid'])
    #request.original_url
    if authentication
      ## If email is not in response
      user = authentication.user
      puts user.email
      session[:user_email] = user.email
      if user.email.include? "@exampleiternia.com"
---
SELECT `authentications`.* FROM `authentications` WHERE `authentications`.`provider` = 'facebook' AND `authentications`.`uid` = '100000552285835' LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'kundanw1990@gmail.com' LIMIT 1

        if email.nil?
          user.email = string+"@exampleiternia.com"
        end
        if user.save(:validate => false)
---
INSERT INTO `users` (`confirmation_sent_at`, `confirmation_token`, `created_at`, `email`, `updated_at`) VALUES (?, ?, ?, ?, ?)
UPDATE `users` SET `last_sign_in_at` = ?, `current_sign_in_at` = ?, `sign_in_count` = ?, `updated_at` = ? WHERE `users`.`id` = 4  [["last_sign_in_at", Thu, 26 Sep 2013 08:51:35 UTC +00:00], ["current_sign_in_at", Thu, 26 Sep 2013 08:51:47 UTC +00:00], ["sign_in_count", 3], ["updated_at", Thu, 26 Sep 2013 08:51:47 UTC +00:00]]

          redirect_to root_url
        end
      else
        @user.authentications.create(:provider => auth['provider'], :uid => auth['uid'], :token => auth['credentials']['token'])
---
INSERT INTO `authentications` (`created_at`, `provider`, `token`, `uid`, `updated_at`, `user_id`) VALUES (?, ?, ?, ?, ?, ?)

  def set_email

    if session[:user_email].nil?
      redirect_to error_page
    else
      email_new = params[:email]
      email_previous = session[:user_email]
      @user = User.find_by_email(email_new)
      @user1 = User.find_by_unconfirmed_email(email_new)
      session.destroy
      if @user.nil? && @user1.nil?
        @user = User.find_by_email(email_previous)
        @user.email = email_new
        @user.save
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'prajakta@iternia.com' LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`unconfirmed_email` = 'prajakta@iternia.com' LIMIT 1
UPDATE `users` SET `updated_at` = ?, `unconfirmed_email` = ?, `confirmation_token` = ?, `confirmation_sent_at` = ? WHERE `users`.`id` = 7