app/controllers/games_controller.rb

    #

    current_user.game.played += 1
    current_user.game.save
---
UPDATE `games` SET `played` = ?, `updated_at` = ? WHERE `games`.`id` = 1  [["played", 1], ["updated_at", Fri, 27 Sep 2013 12:09:22 UTC +00:00]]

  def new
    @game = session[:game]
    if session[:game_flag]
      if @game.counter == @game.word.length
        @result = "You Won"
        @result_word = @game.word
        session[:result] = @result
        session[:result_word] = @result_word
        current_user.game.win += 1
        game = current_user.game
        game.save
---
UPDATE `games` SET `played` = ?, `lose` = ?, `updated_at` = ? WHERE `games`.`id` = 1  [["played", 3], ["lose", 2], ["updated_at", Wed, 25 Sep 2013 13:04:58 UTC +00:00]]